#+TITLE: Kapitel 11: Funktionen Teil 3: Verschachtelung, $\lambda$, Closures, Generatoren  
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{11}

** Verschachtelte Funktionen: Argumente, Rückgabewert 

Argumentübergabe und Rückgabewert funktionieren ganz normal 

#+BEGIN_SRC python :exports both :results output
  def f():
      def g(x):
          print(x+1)
          return x+2

      y = g(17)
      print(y)

  f()
#+END_SRC 

#+RESULTS:
: 18
: 19


** Zugriff auf globale Variablen, lesend

Ohne besondere Vorkehrungen, wenn nur lesen 

#+BEGIN_SRC python :exports both :results output
  def f():
      def g():
          print(x)
      g()

  x = 1
  f()
#+END_SRC 

#+RESULTS:
: 1




** Zugriff auf globale Variablen, schreiben 

Schreibender Zugriff: Erfordert Deklaration mit ~global~

#+BEGIN_SRC python :exports both :results output
  def f():
      def g():
          global x
          x = x + 1 
          print(x)
      g()

  x = 1
  f()
#+END_SRC 

#+RESULTS:
: 2


** Zugriff auf Variablen der äußeren Funktion -- Reihenfolge? 


Liegt es vielleicht an der Reihenfolge? 
- Im Beispiel eben war bei der /Definition/ von ~g~ die Variable ~x~
  noch gar nicht existent
- Muss es das ~x~ schon geben, wenn ~g~ definiert wird? Damit ~g~
  darauf zugreifen kann? 

#+BEGIN_SRC python :exports both :results output
  def f():
      x = 1 
      def g():
          print(x)
      g()

  f()
#+END_SRC 

#+RESULTS:
: 1

** Neues Schlüsselwort: ~nonlocal~ 				   

Analog zu ~global~: Neues Schlüsselwort, um umschließende Variablen zu
verändern
- ~nonlocal~
- Unterschied zu ~global~: Die Variable muss schon existieren! (durch
  Zuweisung, siehe oben)

#+BEGIN_SRC python :exports both :results output
  def f():
      x = 1 
      def g():
          nonlocal x
          x += 1
          print(x)
      g()

  f()
#+END_SRC 

#+RESULTS:
: 2

** Beispiel: Tiefere Verschachtelung (1)


#+BEGIN_SRC python :exports both :results output
  def f():
      x = 1 
      def g():
          def h():
              nonlocal x
              x += 1
              print("x in h:", x)
          h()
          print("x in g:", x)
      g()
      print("x in f:", x)

  f()
#+END_SRC 

#+RESULTS:
: x in h: 2
: x in g: 2
: x in f: 2


** Beispiel: Tiefere Verschachtelung (2)


#+BEGIN_SRC python :exports both :results output
%%tutor -t
def f():
    x = 1 
    def g():
        x = 42
        def h():
            nonlocal x
            x += 1
            print("x in h:", x)
        h()
        print("x in g:", x)
    g()
    print("x in f:", x)

f()
#+END_SRC 

#+RESULTS:
: x in h: 43
: x in g: 43
: x in f: 1


** Vorüberlegung: Referenzen auf Funktionen? 

- Kann man Funktionsnamen wie normale Namen behandeln? 
- Kann man die kopieren, und trotzdem noch aufrufen? 

#+BEGIN_SRC python :exports both :results output
  def f():
      print("f!")

  g = f
  g()
#+END_SRC 

#+RESULTS:
: f!

** Vorüberlegung 2: Funktionsreferenzen als Rückgabewert? 

- Wenn man Funktionsreferenzen kopieren kann
- Dann kann man sie doch bestimmt auch als Rückgabewert einer Funktion
  verwenden? 

#+BEGIN_SRC python :exports code :results output
%%tutor -t
def f():
    def g():
        print("innere Funktion!")
    return g

h = f()
h()
#+END_SRC 

#+RESULTS:
: innere Funktion!

** Analogie: Normales Objekt als Rückgabewert

Zur Analogie: Dieser Code ist ja klar 
- Eine Liste kann man nicht aufrufen, sondern ausgeben
- Aber sonst ist das /genau das gleiche/!

#+BEGIN_SRC python :exports code :results output
  def f():
      g = ["ein", "Beispiel", "Objekt"]
      return g

  h = f()
  print(h)
#+END_SRC 

#+RESULTS:
: ['ein', 'Beispiel', 'Objekt']



** Funktionen mit Parametern als Rückgabe? 

Was passiert, wenn wir eine Funktion zurückgeben, die
Parameter benutzt? 

#+BEGIN_SRC python :exports both :results output
  def f():
      def g(x):
          print("innere Funktion!", x)
      return g

  h = f()
  h("Wert für x")
#+END_SRC 

#+RESULTS:
: innere Funktion! Wert für x

** Funktion mit Zugriff auf nichtlokale Variablen als Rückgabe 

Spannender: 
- Innere Funktion greif auf Parameter der äußeren Funktion zu
- Innere Funktion wird zurückgeben 
- und dann aufgerufen 

Erwartetes Verhalten? 

#+BEGIN_SRC python :exports both :results output
%%tutor -t
def f():
    n = 5
    def g(x):
        print("innere Funktion!", x*n)
    return g

h = f()
h("Wert für x")
#+END_SRC 

#+RESULTS:
: innere Funktion! Wert für xWert für xWert für xWert für xWert für x

** Nicht-lokale Variable selbst als Parameter 

- In obigem Beispiel: ~n~ hatte einen festen Wert
- Aber wo der Wert für ~n~ herkommt ist egal
  - Er muss lediglich vor dem ~def~ von ~g~ vorhanden sein
- Es könnte selbst ein Funktionsparameter sein? 

#+BEGIN_SRC python :exports both :results output
  def f(n):
      def g(x):
          print("innere Funktion!", x*n)
      return g

  h = f(3)
  h("Wert für x")
#+END_SRC 

#+RESULTS:
: innere Funktion! Wert für xWert für xWert für x

** Beispiel -- Aufgeräumt 

#+BEGIN_SRC python :exports both :results output
%%tutor -t
def vervielfacher_fabrik(n):
    def vervielfacher(x):
        return x*n

    return vervielfacher

doppler = vervielfacher_fabrik(2)
fuenffacher = vervielfacher_fabrik(5) 

print(doppler("Mehrfach ausgeben! "))
print(fuenffacher("Mehrfach ausgeben! "))
#+END_SRC 

#+RESULTS:
: Mehrfach ausgeben! Mehrfach ausgeben! 
: Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! 

*** UEBUNG In closures die gemerkte Variable verändern? 

#+BEGIN_SRC python :exports both :results output
  def vervielfacher_fabrik(n):
      def vervielfacher(x):
          nonlocal n
          n += 1
          return x*n

      return vervielfacher

  doppler = vervielfacher_fabrik(2)

  print(doppler("Mehrfach ausgeben! "))
  print(doppler("Noch mehr Text "))
  print(doppler("Schon ganz oft "))
#+END_SRC 

#+RESULTS:
: Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! 
: Noch mehr Text Noch mehr Text Noch mehr Text Noch mehr Text 
: Schon ganz oft Schon ganz oft Schon ganz oft Schon ganz oft Schon ganz oft 




*** ~lambda~ in Factory

Viel besser lesbare Closure-Version: 

#+BEGIN_SRC python :exports both :results output
  def vervielfacher_fabrik(n):
      return lambda x: x*n

  doppler = vervielfacher_fabrik(2)
  fuenffacher = vervielfacher_fabrik(5) 

  print(doppler("Mehrfach ausgeben! "))
  print(fuenffacher("Mehrfach ausgeben! "))
#+END_SRC 

#+RESULTS:
: Mehrfach ausgeben! Mehrfach ausgeben! 
: Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! Mehrfach ausgeben! 



** ~filter~ 

- ~filter~: eingebaute Funktion 
- Signatur: ~map(function, iterable)~
  - Wende die Funktion ~function~ auf jedes Element eines Objektes an
  - Nimm Element in Resultat auf, wenn Funktionswert wahr ist     
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
l = [1, 2, 3, 4, 5]
l2 = filter(lambda x: x % 2 == 1, l)
print(list(l2))
#+END_SRC 

#+RESULTS:
: [1, 3, 5]


** ~map~

- ~map~: eingebaute Funktion 
- Signatur: ~map(function, iterable)~
  - Wende die Funktion ~function~ auf jedes Element eines Objektes an,
    dass zu einer von ~iterable~ abgeleiteten Klasse gehört
  - Produziere iterable mit den entsprechenden Funktionswerten 
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
l = [1, 2, 3, 4, 5]
l2 = map(lambda x: x*x, l)
print(list(l2))

print(" -- ".join(map(str,l)))
#+END_SRC 

#+RESULTS:
: [1, 4, 9, 16, 25]
: 1 -- 2 -- 3 -- 4 -- 5

** \lambda-Ausdrücke und flexible Argumente 

Eine Funktion, die beliebig viele Argumente beliebigen Types mit & dazwischen ausgibt? 

#+BEGIN_SRC python :exports both :results output
out = lambda *x: print(" & ".join(map(str, x)))
out(1, 2, 3, "hallo", "gp1")
#+END_SRC 

#+RESULTS:
: 1 & 2 & 3 & hallo & gp1

** Vergleich: list comprehensions und map/filter 

- Die Beispiele oben sind in Python einfacher und kompakter als list
  comprehensions aufzuschreiben
- Allerdings: dadurch wird die komplette Liste erzeugt -- Sinnvoll? 

#+BEGIN_SRC python :exports code :results output
l = [x for x in range(100000) if x < 2][0:1]
print(l)
#+END_SRC 

#+RESULTS:
: [0, 1]



** Generator: Einfaches Beispiel -- Nutzung 

Generator wird die Werte 1, 2, 3. Danach ~StopIteration~-Exception. 

#+BEGIN_SRC python :exports both :results output
  def gen():
      yield 1
      yield 2
      yield 3

  g = gen()
  print(g)
  print(next(g))
  print(next(g))
  print(next(g))
  try:
      print(next(g))
  except StopIteration:
      print("da kommt nichts mehr")
#+END_SRC 

#+RESULTS:
: <generator object gen at 0x101a80780>
: 1
: 2
: 3
: da kommt nichts mehr

** Generator: Nutzung in Schleife 

Spannender Punkt: Generatoren können wie Iterables in Schleife benutzt
werden 
- Syntax dadurch deutlich einfacher
- ~StopIteration~ führt zum Schleifenende 

#+BEGIN_SRC python :exports both :results output
  def gen():
      yield 1
      yield 2
      yield 3

  for v in gen():
      print(v)
#+END_SRC 

#+RESULTS:
: 1
: 2
: 3



** Beispiel: Unendlicher Generator 

Produziere *alle* Vielfachen von 3 ab Startwert: 

#+BEGIN_SRC python :exports code :results output
  def gen(start):
      # wir wollen alle Vielfache, also Endlosschleife: 
      while True:
          if start % 3 == 0:
              yield start
              print("Restarting with value: ", start)
          start += 1

  # Variable i: Endlosschleife vermeiden
  i = 0         
  for v in gen(16):
      print(v)
      i += 1
      if i > 5:
          break
#+END_SRC 

#+RESULTS:
#+begin_example
18
Restarting with value:  18
21
Restarting with value:  21
24
Restarting with value:  24
27
Restarting with value:  27
30
Restarting with value:  30
33
#+end_example

*** Generatoren statt Listen! 

Kleine syntaktische Änderung: Wir ersetzen ~[]~ durch ~()~ in
Schleifen

#+BEGIN_SRC python :exports both :results output
print("Mit Liste: ")  
for i in [x for x in range(17, 40) if x % 3 == 0]:
    print(i, end=", ")

print("\nMit Generator: ")  
for i in (x for x in range(17, 40) if x % 3 == 0):
    print(i, end=", ")
#+END_SRC 

#+RESULTS:
: Mit Liste: 
: 18, 21, 24, 27, 30, 33, 36, 39, 
: Mit Generator: 
: 18, 21, 24, 27, 30, 33, 36, 39, 





** Eingerahmte Ausgabe -- Version 1 

Version 1: Eine einfache factory 

#+BEGIN_SRC python :exports both :results output
  def f():
      print("Ausgabe von f")

  def einrahmer_fabrik():
      def einrahmer():
          print("=====")
          f()
          print("=====")

      return einrahmer

  f_neu = einrahmer_fabrik()
  f_neu()
#+END_SRC 

#+RESULTS:
: =====
: Ausgabe von f
: =====


** Eingerahmte Ausgabe -- Version 2 

Version 1 ist unnötig speziell
- Factory-Muster kann doch Parameter nehmen (Closures!) 

#+BEGIN_SRC python :exports both :results output
  def f():
      print("Ausgabe von f")

  def g():
      print("Ausgabe von g")

  def einrahmer_fabrik(fct):
      def einrahmer():
          print("=====")
          fct()
          print("=====")

      return einrahmer

  f_neu = einrahmer_fabrik(f) 
  g_neu = einrahmer_fabrik(g) 
  
  f_neu() 
  g_neu() 
#+END_SRC 

#+RESULTS:
: =====
: Ausgabe von f
: =====
: =====
: Ausgabe von g
: =====


** Eingerahmte Ausgabe -- Version 3 


Den einrahmenden Text kann man auch zum Parameter machen

#+BEGIN_SRC python :exports both :results output
    def f():
        print("Ausgabe von f")

    def g():
        print("Ausgabe von g")

    def einrahmer_fabrik(fct, s="==========="):
        def einrahmer():
            print(s)
            fct()
            print(s)

        return einrahmer

    f_neu = einrahmer_fabrik(f, "***********") 
    g_neu = einrahmer_fabrik(g) 
  
    f_neu() 
    g_neu() 
#+END_SRC 

#+RESULTS:
: ***********
: Ausgabe von f
: ***********
: ===========
: Ausgabe von g
: ===========



** Eingerahmte Ausgabe -- Version 4 

Brauchen wir die ursprünglich Version von ~f~ noch? Nein? 
- Dann brauchen wir auch keinen neuen Namen! 

#+BEGIN_SRC python :exports both :results output
  def f():
      print("Ausgabe von f")

  def einrahmer_fabrik(fct, s="==========="):
      def einrahmer():
          print(s)
          fct()
          print(s)

      return einrahmer

  # Wir lassen die Variable f ein neues Funktionsobjekt referenzieren:
  f = einrahmer_fabrik(f, "***********") 
  
  f()
#+END_SRC 

#+RESULTS:
: ***********
: Ausgabe von f
: ***********

** Decorator: kompakte Syntax -- Beispiel

#+BEGIN_SRC python :exports both :results output
  def einrahmer_fabrik(fct):
      def einrahmer():
          print("=====")
          fct()
          print("=====")

      return einrahmer

  @einrahmer_fabrik
  def f():
      print("Ausgabe von f")

  f()
#+END_SRC 

#+RESULTS:
: =====
: Ausgabe von f
: =====

** Decorator: kompakte Syntax -- Beispiel mit typischen Namen 

Die ~_fabrik~-Terminologie wird bei Dekoratoren typischerweise
weggelassen 

#+BEGIN_SRC python :exports both :results output
  def einrahmer(fct):
      def _einrahmer():
          print("=====")
          fct()
          print("=====")

      return _einrahmer

  @einrahmer
  def f():
      print("Ausgabe von f")

  f()
#+END_SRC 

#+RESULTS:
: =====
: Ausgabe von f
: =====

** @-Decorators: Beispiel Benchmarking 

Wie bestimmt man Zeitverbrauch einer Funktion? 
- Man schaut in einem Dekorator vor und nach dem Aufruf der Funktion
  auf die Uhr! 

#+BEGIN_SRC python :exports both :results output
  import time

  def benchmark(fct):
      def _benchmark(*args, **kwargs):
          tstart = time.time()
          fct(*args, **kwargs)
          tend = time.time()

          print("{} ({}, {}) verbrauchte {} Sekunden".format(
              fct.__name__, args, kwargs, tend-tstart))

      return _benchmark

  @benchmark 
  def f1(s):
      print("Anfang f1")
      time.sleep(s)
      print("Ende f1")


  f1(0.2)
  f1(0.6)
#+END_SRC 

#+RESULTS:
: Anfang f1
: Ende f1
: f1 ((0.2,), {}) verbrauchte 0.2000889778137207 Sekunden
: Anfang f1
: Ende f1
: f1 ((0.6,), {}) verbrauchte 0.6030921936035156 Sekunden

** @-Decorator: Property 

Tatsächlich kennen wir schon einen Decorator: Property 
- Bisher nur als eingebaute Funktion ~property~
- Es fehlt also nur noch der Zucker
  - Getter: mit ~@property~ dekorieren; Funktionsname wird Name der
    Property
  - Setter: mit ~@Propertyname.setter~ dekorieren; Funktionsname muss
    Name der Property sein, mit value

#+BEGIN_SRC python :exports both :results output
  class Temperature:
      def __init__(self, temp=0):
          # auch Methoden der Klasse greifen normal auf das Attribut zu: 
          self._temperature = temp

      @property
      def temperature(self):
          print("Lesender Zugriff")
          return self._temperature

      @temperature.setter
      def temperature(self, value):
          print("Schreibender Zugriff")
          if value < 0:
              raise ValueError("Keine negativen Temperaturen in Kelvin!")
          else:
              self._temperature = value

  t1 = Temperature(17)
  print(t1.temperature) 
  t1.temperature = 42 
  print(t1.temperature) 
#+END_SRC 

#+RESULTS:
: Lesender Zugriff
: 17
: Schreibender Zugriff
: Lesender Zugriff
: 42

** @-Decoratoren verketten? 


#+BEGIN_SRC python :exports both :results output
def star(func):
    def inner(*args, **kwargs):
        print("*" * 30)
        func(*args, **kwargs)
        print("*" * 30)
    return inner

def percent(func):
    def inner(*args, **kwargs):
        print("%" * 30)
        func(*args, **kwargs)
        print("%" * 30)
    return inner

@star
@percent
def printer(msg):
    print(msg)

printer("Hallo GP1!")
#+END_SRC 

#+RESULTS:
: ******************************
: %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
: Hallo GP1!
: %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
: ******************************

[[http://www.programiz.com/python-programming/decorator][Quelle des Beispiels]]


